[
  {
    "id": "skill001",
    "category_id": 1,
    "slogan": "Unleash your inner artist, one note at a time.",
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "This comprehensive beginner guitar course is designed for those who are eager to start their musical journey with confidence and creativity. Over the span of multiple sessions, students will learn fundamental chords, strumming patterns, finger‑picking techniques, and the basic music theory that serves as the foundation for becoming a versatile guitarist. Each lesson is structured to gradually increase in complexity, allowing learners to gain confidence while playing popular songs that inspire motivation. Alex Martin, a seasoned musician with years of experience teaching students of all ages, emphasizes hands‑on practice and personalized guidance, ensuring that each student progresses at their own pace. Beyond technical skills, the course also encourages creativity, helping students understand rhythm, timing and dynamics so they can play expressively, not just mechanically. By the end of the program, learners will not only be able to play several beginner‑friendly songs but also develop a strong musical intuition and the ability to continue improving independently. The curriculum incorporates interactive exercises, video demonstrations, and one‑on‑one feedback, creating an engaging and enjoyable learning experience. Whether your goal is to perform for friends, join a band or simply enjoy the satisfaction of making music, this course lays a solid foundation that empowers you to explore the limitless possibilities of guitar playing.",
    "image": "https://i.ibb.co.com/gFXrnFJ2/Black-Simple-Cyber-Security-Instagram-Post.png"
  },
  {
    "id": "skill002",
    "category_id": 1,
    "slogan": "Unleash your inner artist, one note at a time.",
    "skillName": "Piano Fundamentals",
    "providerName": "Sophia Turner",
    "providerEmail": "sophia@skillswap.com",
    "price": 25,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "This step‑by‑step piano program for beginners combines foundational music theory, hand‑coordination techniques, and engaging practice sessions to build your confidence at the piano keyboard. From your very first lesson you will learn how to position your hands, recognise basic rhythm patterns, and navigate simple sheet music. Sophia Turner guides you through carefully designed exercises that combine reading musical notation, understanding chord progressions, and playing short songs aimed at reinforcing new skills while ensuring you’re motivated and having fun. As you progress, the course introduces left‑hand accompaniment, two‑hand coordination and simple improvisation tasks to foster creativity. By the time you complete the program, you will not only be able to play a variety of beginner‑friendly pieces, but you will also have a strong foundation in technique and theory that allows you to explore more advanced material independently. Whether your goal is to play for your own enjoyment, accompany a vocalist, or begin a formal study in music, this course gives you the tools and confidence to succeed.",
    "image": "https://i.ibb.co.com/gFXrnFJ2/Black-Simple-Cyber-Security-Instagram-Post.png"
  },
  {
    "id": "skill003",
    "category_id": 1,
    "slogan": "Unleash your inner artist, one note at a time.",
    "skillName": "Vocal Training for Beginners",
    "providerName": "David Chen",
    "providerEmail": "david@skillswap.com",
    "price": 18,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "This vocal training program for beginners focuses on building your vocal technique, enhancing tone and pitch control, and nurturing your confidence as a singer through structured guided exercises and real‑time feedback. David Chen begins by teaching proper breathing mechanics, vocal warm‑ups, posture and projection. You will then progress into tonal exercises, pitch matching, scale work, and simple songs that reinforce what you’ve learned in a practical way. The lessons emphasise good vocal health and technique, enabling you to sing comfortably across your range and avoid strain or injury. As your skills develop, you'll explore expressive singing, phrasing, dynamics, and emotional connection—so you don't just sing notes, you communicate meaning. Whether you want to sing for pleasure, prepare for auditions or join a choir, this course gives you the tools and guidance to do so with confidence and clarity. With each session, you'll notice improvement in your tone, consistency and performance ability—ultimately helping you become a more resilient and expressive vocalist.",
    "image": "https://i.ibb.co.com/gFXrnFJ2/Black-Simple-Cyber-Security-Instagram-Post.png"
  },
  {
    "id": "skill005",
    "category_id": 1,
    "slogan": "Unleash your inner artist, one note at a time.",
    "skillName": "Music Production Basics",
    "providerName": "Luca Rossi",
    "providerEmail": "luca@skillswap.com",
    "price": 28,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "In this music production essentials course, you'll be guided through every stage of creating, mixing and editing your own tracks using digital audio workstations like FL Studio or Ableton. Luca Rossi begins with introducing you to the software interface, signal flow, sampling, beat‑making and arranging, then moves into layering instruments, effects processing, mixing techniques, and building your own final mix. You’ll also explore sound design fundamentals, understanding how to shape and sculpt sounds through synthesis and processing. Along the way, you will work on real‑world style projects—building beats, composing short productions, collaborating ideas and receiving detailed feedback from Luca. The course emphasises creativity, workflow efficiency and critical listening skills, so by the end you can confidently export polished tracks that reflect your own style. Whether your ambition is to launch a podcast, produce songs for friends, or begin a serious music production journey, this course is your springboard into the evolving world of audio creation.",
    "image": "https://i.ibb.co.com/gFXrnFJ2/Black-Simple-Cyber-Security-Instagram-Post.png"
  },
  {
    "id": "skill006",
    "category_id": 2,
    "slogan": "Break barriers, speak the world.",
    "skillName": "IELTS Practice Sessions",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 10,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "This immersive IELTS practice course is meticulously crafted to prepare students for the speaking, writing, reading, and listening sections of the exam. Each session focuses on practical exercises and strategies to improve accuracy, fluency, and confidence. Students engage in mock tests simulating real exam conditions to identify strengths and weaknesses across all domains. Experienced instructor Sara Hossain provides detailed feedback, personalised tips and study plans to ensure consistent progress. In addition to exam‑specific techniques, the program improves general English skills: grammar accuracy, vocabulary building, pronunciation clarity and effective communication in academic or professional settings. Through group discussions, peer review, one‑on‑one coaching and interactive tasks, learners build stronger confidence and familiarity with exam formats while gaining the ability to express complex ideas clearly. Upon completion, students not only gain strong command of English but also the strategic mindset and self‑assurance needed to achieve high scores and thrive in real‑life international environments.",
    "image": "https://i.ibb.co.com/21FkL2gb/Blue-and-Black-Modern-Digital-Marketing-Agency-Instagram-Post.png"
  },
  {
    "id": "skill007",
    "category_id": 2,
    "slogan": "Break barriers, speak the world.",
    "skillName": "Spanish for Travelers",
    "providerName": "Juan Alvarez",
    "providerEmail": "juan@skillswap.com",
    "price": 15,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Designed for travellers who want to confidently communicate in Spanish during their trips, this course teaches essential phrases, conversational structures and cultural tips that make your travel experience smoother and richer. Juan Alvarez guides learners through everyday scenarios—airport check‑in, ordering food, asking directions, making friends–all in Spanish. You’ll practice pronunciation, listening comprehension and dialogue formation, with lots of role‑play to build comfort and fluency fast. In addition to language skills, the course offers cultural context, helping you understand local customs, politeness norms and travel‑specific vocabulary. At the end you’ll have the ability to engage in basic Spanish conversations, order meals, ask for assistance and immerse yourself in travel environments with confidence. Whether it’s a weekend getaway or a longer trip, this course gives you practical tools to speak Spanish and connect with people authentically.",
    "image": "https://i.ibb.co.com/21FkL2gb/Blue-and-Black-Modern-Digital-Marketing-Agency-Instagram-Post.png"
  },
  {
    "id": "skill008",
    "category_id": 2,
    "slogan": "Break barriers, speak the world.",
    "skillName": "Japanese Language Basics",
    "providerName": "Hana Ito",
    "providerEmail": "hana@skillswap.com",
    "price": 22,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "This beginner‑friendly Japanese language course introduces learners to everyday communication, essential grammar, simple characters (hiragana/katakana), and conversational phrases that help you navigate real‑life situations. Over the sessions, Hana Ito guides you through how to greet people, ask questions, talk about yourself, order meals, and explore cultural contexts. You’ll engage in listening exercises, pronunciation drills, mini‑dialogues and practice writing basic words in Japanese script. The approach emphasises accuracy, repetition and immersive tasks so you gradually build confidence in speaking, reading and writing in Japanese. By the end of the program, you’ll be comfortable participating in basic conversations—introducing yourself, asking for directions, ordering food—and you'll have the foundation to continue towards more advanced levels. If you’re planning a trip, making Japanese friends or simply want to expand your language horizons, this course gives you a solid and culturally rich beginning.",
    "image": "https://i.ibb.co.com/21FkL2gb/Blue-and-Black-Modern-Digital-Marketing-Agency-Instagram-Post.png"
  },
  {
    "id": "skill009",
    "category_id": 2,
    "slogan": "Break barriers, speak the world.",
    "skillName": "Business English Mastery",
    "providerName": "Clara James",
    "providerEmail": "clara@skillswap.com",
    "price": 18,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "This Business English Mastery course is tailored for professionals looking to elevate their English communication in meetings, presentations, negotiations and interviews. Clara James leads each class with a focus on real‑world business situations, teaching advanced vocabulary, idiomatic expressions, formal writing styles, concise speaking and active listening skills. You’ll engage in simulated business scenarios—lead a meeting, present a product, negotiate a deal—enabling you to practise and receive feedback on your performance. The program also addresses cross‑cultural communication, email etiquette, report writing, and persuasive speaking so you can confidently engage in global business contexts. By the end of the course you will have improved clarity, professionalism and fluency in business‑oriented English, giving you a competitive advantage in multinational teams, corporate settings or international roles.",
    "image": "https://i.ibb.co.com/21FkL2gb/Blue-and-Black-Modern-Digital-Marketing-Agency-Instagram-Post.png"
  },
  {
    "id": "skill010",
    "category_id": 2,
    "slogan": "Break barriers, speak the world.",
    "skillName": "French Conversation Club",
    "providerName": "Luc Moreau",
    "providerEmail": "luc@skillswap.com",
    "price": 20,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "Join this French Conversation Club to build your spoken fluency, comprehension and cultural confidence in a relaxed group environment. Led by Luc Moreau, sessions focus on everyday discussion topics—travel, hobbies, news, food and lifestyle—enabling you to practice and find your voice in French. The atmosphere is supportive, encouraging mistakes as part of learning and emphasising interactive dialogue rather than rote memorisation. Throughout the course you'll also explore idioms, pronunciation nuances, listening to native speakers, and constructive peer feedback. By the end you will feel comfortable engaging in casual conversations, understanding spoken French in social settings and communicating more naturally. Whether you’re preparing for travel, working abroad or simply want to speak French with friends, this club offers you an effective and enjoyable path to fluency.",
    "image": "https://i.ibb.co.com/21FkL2gb/Blue-and-Black-Modern-Digital-Marketing-Agency-Instagram-Post.png"
  },
  {
    "id": "skill014",
    "category_id": 3,
    "slogan": "Transform ideas into stunning visuals.",
    "skillName": "Interior Design Basics",
    "providerName": "Laila Haddad",
    "providerEmail": "laila@skillswap.com",
    "price": 24,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "This extensive Interior Design Basics course introduces you to the essential principles of creating harmonious, functional and aesthetically pleasing spaces—be it a home, office or small commercial environment. Over the sessions you’ll explore space planning, lighting dynamics, colour theory, material selection, furniture arrangement and mood‑board creation. Laila Haddad guides you through case studies, hands‑on projects and real‑world examples so you learn both the art and science of interior design. You will learn how to assess a space, define its function, establish a design style, select appropriate furnishings, manipulate light and texture, and ensure your design works for real people who will inhabit the space. The program also incorporates sustainability, ergonomics and cost‑effective solutions so you can design practically as well as creatively. By the conclusion, you will have created your own design concept, developed visual presentation skills and understood how to translate ideas into a finished environment people feel comfortable and inspired in. Whether you wish to design professionally, refresh your living space or simply satisfy a creative interest, this course gives you the tools and confidence to succeed.",
    "image": "https://i.ibb.co.com/TqnxxvFn/Black-Simple-Cyber-Security-Instagram-Post-1.png"
  },
  {
    "id": "skill015",
    "category_id": 3,
    "slogan": "Transform ideas into stunning visuals.",
    "skillName": "Graphic Design Portfolio Building",
    "providerName": "Mark Jensen",
    "providerEmail": "mark@skillswap.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "This Graphic Design Portfolio Building course empowers you to craft a strong, professional portfolio that stands out in job applications, client pitches or freelance marketplaces. Mark Jensen guides you through project planning, concept development, layout principles, typography, colour schemes, branding fundamentals and digital tool workflows. You’ll complete several real‑world design projects—from posters to digital mock‑ups to branding covers—and receive targeted feedback to refine your work. The course emphasises not only visual excellence but strategic thinking—how to showcase your best work, communicate your unique voice and present it in a way that appeals to employers or clients. By the end you will have a refined portfolio, a deeper understanding of design process, improved software fluency and the confidence to tackle real design briefs. Whether you’re a recent graduate, career changer or aspiring freelancer, this course gives you the clarity, skills and creative mindset to succeed in the design industry.",
    "image": "https://i.ibb.co.com/TqnxxvFn/Black-Simple-Cyber-Security-Instagram-Post-1.png"
  },
  {
    "id": "skill016",
    "category_id": 4,
    "slogan": "Empower your mind, create the future.",
    "skillName": "Intro to App Development",
    "providerName": "Nina Zhang",
    "providerEmail": "nina@skillswap.com",
    "price": 30,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "This hands‑on course introduces you to mobile app development from the ground up—covering planning, user interface design, logic implementation, testing and deployment of your first Android application. Nina Zhang guides you through Java fundamentals, Android Studio setup, UI layout, event handling, data persistence and preparing your app for release. Along the way you’ll build simple but functional applications, explore best practices for user experience, debug issues, refine features and publish to a test store. By the end you’ll understand the full lifecycle of an Android app—from idea to executable product—and you’ll be well‑positioned to pursue more advanced topics like iOS development or cross‑platform frameworks. Whether you're an aspiring developer or designer who wants to translate ideas into usable software, this course provides the support, workflow insight and technical mentorship you need.",
    "image": "https://i.ibb.co.com/GQ4GcWj5/Green-and-Pale-Yellow-Simple-Food-Apps-Instagram-Post.png"
  },
  {
    "id": "skill017",
    "category_id": 4,
    "slogan": "Empower your mind, create the future.",
    "skillName": "Python for Beginners",
    "providerName": "Omar Rahman",
    "providerEmail": "omar@skillswap.com",
    "price": 25,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "This hands‑on Python course is designed for absolute beginners who want to learn programming from the ground up. Students will be introduced to the fundamentals of Python: variables, data types, control flow, functions and object‑oriented programming. Through interactive exercises, real‑world examples and mini‑projects, learners will gain practical experience in writing Python scripts and solving problems efficiently. The course emphasises critical thinking and algorithmic approaches, helping students understand not only how to code but also how to think like a programmer. By the end of the program, students will be able to build functional applications, automate repetitive tasks and even pursue more advanced topics such as web development, data analysis or machine learning. Instructor Omar Rahman provides clear explanations, hands‑on guidance and personalised support to ensure every student progresses at their own pace and builds confidence in their coding abilities.",
    "image": "https://i.ibb.co.com/GQ4GcWj5/Green-and-Pale-Yellow-Simple-Food-Apps-Instagram-Post.png"
  },
  {
    "id": "skill018",
    "category_id": 4,
    "slogan": "Empower your mind, create the future.",
    "skillName": "Frontend Web Development",
    "providerName": "Aaron Patel",
    "providerEmail": "aaron@skillswap.com",
    "price": 32,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "This comprehensive Frontend Web Development course equips you with the skills needed to build responsive, interactive websites from scratch using HTML, CSS and JavaScript. Over the sessions, Aaron Patel guides you through the fundamentals of markup and styling, client‑side scripting, DOM manipulation, responsive design, and basic frameworks or libraries. You’ll complete hands‑on mini‑projects such as landing pages, portfolio sites and interactive components, giving you a portfolio of finished work. Emphasis is placed on modern best practices: mobile‑first design, accessibility, performance optimisation and code cleanliness. By the end of the course, you will not only understand how websites are built and behave in the browser, but you will have the confidence to launch your own web projects or continue to more advanced full‑stack development. This course is ideal if you are transitioning into web dev, up‑skilling or starting a freelancing journey.",
    "image": "https://i.ibb.co.com/GQ4GcWj5/Green-and-Pale-Yellow-Simple-Food-Apps-Instagram-Post.png"
  },
  {
    "id": "skill019",
    "category_id": 4,
    "slogan": "Empower your mind, create the future.",
    "skillName": "React JS Crash Course",
    "providerName": "Levi Torres",
    "providerEmail": "levi@skillswap.com",
    "price": 35,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "This fast‑paced React JS Crash Course is designed to take you from zero to building dynamic web apps using React hooks, state management and API integration in a short time. Levi Torres begins with setting up the React environment, understanding component architecture and JSX, then moves into hooks (useState, useEffect), context, routing, and connecting to backend services. You’ll build a complete project—fetching and displaying data, managing state, handling forms and deploying your app. Throughout you’ll learn debugging strategies, best practices and performance optimisation techniques. By the end you’ll have a fully functional React application in your portfolio and the confidence to continue building more advanced React or full‑stack apps. If you’ve already learned some web fundamentals, this course will accelerate your path into modern frontend engineering and help you launch real‑world projects.",
    "image": "https://i.ibb.co.com/GQ4GcWj5/Green-and-Pale-Yellow-Simple-Food-Apps-Instagram-Post.png"
  },
  {
    "id": "skill020",
    "category_id": 4,
    "slogan": "Empower your mind, create the future.",
    "skillName": "Intro to Cybersecurity",
    "providerName": "Priya Nair",
    "providerEmail": "priya@skillswap.com",
    "price": 28,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "This Intro to Cybersecurity course gives you a strong foundation in understanding online threats, ethical hacking principles and network protection fundamentals. Led by Priya Nair, the program covers key topics such as threat landscape, security architecture, vulnerability assessment, penetration testing basics and incident response. You’ll participate in simulated security scenarios, hands‑on practical labs and case‑studies showing how attacks happen and how they can be defended. The course emphasises both theory and real‑world skill development, helping you become security‑aware rather than just reading about it. At the end of the program you’ll be equipped with the vocabulary, concepts and practical mindset to pursue further specialised security training or roles, and you’ll understand how to apply secure‑by‑design thinking in software or system environments. Whether you’re a developer, IT professional or curious beginner, this course empowers you to protect systems, data and network integrity.",
    "image": "https://i.ibb.co.com/GQ4GcWj5/Green-and-Pale-Yellow-Simple-Food-Apps-Instagram-Post.png"
  },
  {
    "id": "skill021",
    "category_id": 5,
    "slogan": "Stronger, healthier, happier every day.",
    "skillName": "Yoga for Beginners",
    "providerName": "Ravi Mehta",
    "providerEmail": "ravi@skillswap.com",
    "price": 15,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "This comprehensive Yoga for Beginners program is perfect for anyone looking to improve flexibility, strength, balance and overall wellbeing. The course covers foundational yoga postures, breathing techniques and mindfulness exercises, emphasising alignment, safety and gradual progression. Each session is structured to be accessible for all ages and fitness levels, ensuring students feel confident and supported while learning. Ravi Mehta provides detailed guidance, modifications for different abilities and tips for incorporating yoga into daily life. Students also explore meditation and relaxation practices to reduce stress, enhance focus and promote mental clarity. By completing this course, learners will develop a strong understanding of yoga principles, establish a consistent personal practice and experience the physical and mental benefits of this ancient discipline. The program encourages a holistic approach to health, combining movement, breath and mindfulness to cultivate a balanced lifestyle and lifelong wellness habits.",
    "image": "https://i.ibb.co.com/dNp7Rxp/Black-Simple-Cyber-Security-Instagram-Post-2.png"
  },
  {
    "id": "skill023",
    "category_id": 5,
    "slogan": "Stronger, healthier, happier every day.",
    "skillName": "Home Workout Program",
    "providerName": "James Roy",
    "providerEmail": "james@skillswap.com",
    "price": 12,
    "rating": 4.6,
    "slotsAvailable": 6,
    "description": "This Home Workout Program is crafted to help you get fit without a gym—using just your bodyweight and minimal equipment. The course includes full­body routines, mobility drills, core strengthening, cardio bursts and flexibility training designed to be done at home or on the go. Over the sessions, James Roy guides you through proper form, progressive overload methods, warm‑up/cool‑down protocols and tracking your progress. The program is suitable for beginners and intermediate levels, offering variations and modifications so everyone can participate safely. Beyond physical workouts, you’ll learn how to set realistic goals, create sustainable habits and maintain consistency even when time is limited. By the end of the program, you will have improved stamina, stronger muscles, better posture and a toolkit of routines you can continue independently. Whether your goal is weight management, athletic performance or simply staying active in a busy schedule, this program gives you structure, motivation and results.",
    "image": "https://i.ibb.co.com/dNp7Rxp/Black-Simple-Cyber-Security-Instagram-Post-2.png"
  },
  {
    "id": "skill024",
    "category_id": 5,
    "slogan": "Stronger, healthier, happier every day.",
    "skillName": "Nutrition for Everyday Life",
    "providerName": "Mila Sharma",
    "providerEmail": "mila@skillswap.com",
    "price": 18,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "In this Nutrition for Everyday Life course, you’ll learn how to balance meals, build healthy eating habits and understand how food fuels your body for long‑term wellbeing. Mila Sharma leads you through macronutrients, micronutrients, meal planning, grocery shopping strategies, reading food labels and adapting nutrition to your lifestyle. The sessions also explore the psychology of eating, mindful practices, and how to sustain dietary changes in a busy life. You’ll gain actionable guidance—not just theory—meaning you can apply what you learn immediately, set realistic goals, monitor progress and adjust for your personal needs. By the end of the course, you’ll have clarity about what to eat, how to eat and why it matters, along with improved confidence in your food choices. Whether your aim is better health, weight management or simply feeling more energised, this course gives you a solid nutrition mindset and tools you can live with long after you finish.",
    "image": "https://i.ibb.co.com/dNp7Rxp/Black-Simple-Cyber-Security-Instagram-Post-2.png"
  },
  {
    "id": "skill025",
    "category_id": 5,
    "slogan": "Stronger, healthier, happier every day.",
    "skillName": "Stress Management Strategies",
    "providerName": "Rahul Sen",
    "providerEmail": "rahul@skillswap.com",
    "price": 16,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "This Stress Management Strategies course shows you practical techniques to manage stress, cultivate resilience and maintain a positive mindset in everyday life. Rahul Sen walks you through mindfulness practices, breathing techniques, cognitive behavioural tools, time‑management methods and lifestyle adjustments to reduce mental load and build emotional strength. You will practice guided exercises, reflective journaling, relaxation routines and group discussions so you learn to recognise stress triggers, respond healthily and recover faster. Additionally, the course covers how sleep, nutrition, movement and social support contribute to your mental wellbeing—so you can make holistic improvements. By the completion of the program you’ll have developed greater self‑awareness, new coping mechanisms and the ability to thrive under pressure instead of being overwhelmed. Whether you’re a student, professional or simply someone seeking calmer daily habits, this course equips you with mindset, skills and routines to live stronger, healthier and happier every day.",
    "image": "https://i.ibb.co.com/dNp7Rxp/Black-Simple-Cyber-Security-Instagram-Post-2.png"
  },
  {
    "id": "skill026",
    "category_id": 6,
    "slogan": "Turn imagination into expression.",
    "skillName": "Creative Writing Workshop",
    "providerName": "Emily Dawson",
    "providerEmail": "emily@skillswap.com",
    "price": 18,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "This Creative Writing Workshop is designed to unlock your storytelling potential and elevate your writing skills through exploration, practice and feedback. Participants will dive into technique for character development, plot structuring, descriptive language, dialogue crafting and narrative pacing. The course encourages self‑expression, creativity and experimentation, guiding writers through writing prompts, peer review, and instructor feedback sessions. Emily Dawson, an experienced writer and mentor, helps you refine your voice, reveal your style, and gain confidence in your work. Beyond fiction, you’ll explore non‑fiction, personal essays and poetry—so you learn to adapt the tools of storytelling across formats. You will also learn revision practices, how to overcome writer’s block, give and receive feedback, and polish a piece ready for sharing or publication. By the end of the program, you’ll have completed multiple polished writing pieces, developed a deeper understanding of storytelling principles and gained the mindset needed to continue writing independently. Whether you are writing for pleasure, preparing for publication or joining writing communities, this workshop nurtures your craft and turns imagination into expression.",
    "image": "https://i.ibb.co.com/Fb5CJFRn/Black-Simple-Cyber-Security-Instagram-Post-3.png"
  }
]
